[
    {
        "title": "DSC 209 Project 1 Final Submission",
        "image": "https://alhayslip.github.io/portfolio/images/project_1_final.png",
        "description": "This histogram was used to visualize organic products at Whole Foods by their food processing score"
    },
    {
        "title": "Sequi molestias labore expedita?",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Aliquid, explicabo provident qui corporis praesentium rem sequi molestiae eaque accusamus laborum in eligendi itaque non nesciunt laboriosam harum dolores animi optio mollitia culpa illum. Molestiae hic blanditiis voluptates eveniet?"
    },
    {
        "title": "Quaerat temporibus error saepe!",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Voluptas illum ratione dicta unde voluptatibus, iure quam ea dolore, culpa amet blanditiis! Laborum delectus optio sunt consectetur minima, quibusdam fuga deserunt hic animi explicabo debitis! Doloribus consequuntur explicabo ipsa."
    },
    {
        "title": "Dolorum eum in blanditiis?",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Optio deserunt, ipsam ex rem, nisi porro itaque delectus voluptates, ad molestias dolorem autem perspiciatis nulla velit consequuntur aut rerum quis quod. Quas veritatis voluptas voluptatem minima iusto, nemo reprehenderit."
    },
    {
        "title": "Nostrum facilis deserunt consequuntur!",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Omnis rem suscipit blanditiis similique quidem ducimus nam ex deserunt sapiente, animi dolorum veniam enim rerum voluptatibus molestiae distinctio, vel quas a ipsum aut. A dolorum iure consequuntur consectetur velit!"
    },
    {
        "title": "Veritatis placeat distinctio ea.",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Aut fuga tempora saepe quos incidunt eius magnam in ratione commodi at consequatur totam labore laudantium cum, iure possimus culpa quo sit fugit placeat deleniti exercitationem quod? Voluptatibus, expedita accusantium!"
    },
    {
        "title": "Quos laborum fugiat vitae.",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Sint quo nostrum non repudiandae, praesentium harum laborum perspiciatis. Nulla illo modi, asperiores quas maiores, numquam cum iste commodi voluptatibus rem quae sint fugit ea? Adipisci autem unde esse rem!"
    },
    {
        "title": "Magni amet laborum deleniti!",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Voluptatibus ipsum consectetur vitae, corrupti pariatur sequi maiores perferendis exercitationem quia, odit eaque, quasi fuga dolor illo. Autem sed repudiandae explicabo? Nisi cumque debitis sed provident dolores incidunt blanditiis eius."
    },
    {
        "title": "Laudantium sequi similique aut!",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Harum ut nemo explicabo. Aperiam quam porro facilis facere, doloremque qui totam obcaecati omnis animi. Nesciunt pariatur, excepturi, eaque quo nam ratione incidunt officia maiores consequatur, cum ex repudiandae iure."
    },
    {
        "title": "Ipsam autem veritatis perspiciatis.",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Accusamus quo dolorum ut rem, incidunt ducimus molestiae consectetur perspiciatis accusantium aspernatur nemo quod dignissimos, voluptates minus iusto nobis iste soluta. Libero illum et nemo distinctio blanditiis id dicta totam."
    },
    {
        "title": "Deleniti eum recusandae ex.",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Aliquid reprehenderit, assumenda temporibus alias ex, laborum fuga recusandae suscipit aspernatur sequi rerum. Ratione possimus unde veritatis assumenda, reprehenderit rem excepturi error deserunt eos ab totam illo eligendi beatae saepe?"
    },
    {
        "title": "Incidunt quas sit dolores!",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Exercitationem, veniam libero voluptates nihil quidem ullam dicta cum magnam aliquam odio tempora beatae consequatur minus. Molestias ab amet esse veniam rem. Necessitatibus veniam perspiciatis quo alias nesciunt consequatur porro?"
    }
]