[
    {
        "title": "DSC 209 Project 1 Final Submission",
        "image": "https://alhayslip.github.io/portfolio/images/project_1_final.png",
        "description": "This visualization was created from the grocery db csv file that can be found here: https://dsc-courses.github.io/dsc209r-2025-fa/projects/project1/#data-grocery-store-foods. This histogram was used to visualize organic products at Whole Foods by their food processing score"
    },
    {
        "title": "DSC 209 Project 2 Proposition",
        "image": "https://alhayslip.github.io/portfolio/images/lineplot.png",
        "description": "This visualization was created from the Civilian Complaints Against New York City Police Officers dataset, which can be found here https://dsc-courses.github.io/dsc209r-2025-fa/projects/project2/#datasets. This line graph showcases that neighborhood policing in New York resulting in an increase in complaints filed"
    },
    {
        "title": "DSC 209 Project 2 2015 Neighborhood Policing Bar Plot",
        "image": "https://alhayslip.github.io/portfolio/images/2015_barplot.png",
        "description": "This visualization was created from the Civilian Complaints Against New York City Police Officers dataset, which can be found here https://dsc-courses.github.io/dsc209r-2025-fa/projects/project2/#datasets. This barplot indicates that the implementation in neighborhood policing in 2015 increased the number of complaints filed."
    },
    {
        "title": "DSC 209 Project 2 Precinct 75 Pie Chart Before and After Neighborhood Policing",
        "image": "https://alhayslip.github.io/portfolio/images/pie_chart.png",
        "description": "This visualization was created from the Civilian Complaints Against New York City Police Officers dataset, which can be found here https://dsc-courses.github.io/dsc209r-2025-fa/projects/project2/#datasets. I created a pie chart to indicate the distribution of complaints filed from January 2011 to December in Precinct 75 by whether it occurred before or after neighborhood policing was implemented in New York City."
    },
    {
        "title": "DSC 207 Mini Project Boxplot of Happiness by Country",
        "image": "https://alhayslip.github.io/portfolio/images/boxplots.png",
        "description": "For my DSC 207 Python course, I was tasked with analyzing happiness scores by country, which can be found here https://www.kaggle.com/datasets/bhanupratapbiswas/world-happiness-2016. This boxplot visualizes the distribution of life expectancy for region that is referenced in the dataset."
    },
    {
        "title": "DSC 207 Final Project KMeans of NBA field goals data",
        "image": "https://alhayslip.github.io/portfolio/images/kmeans.png",
        "description": "For my DSC 207 Python course, I decided to analyze data for NBA Field Goals attempted between the 2004 and 2022 seasons. This visualization represents a KMeans Clustering Analysis that I performed to categorize groups of players by the amount of field goals attempted and field goal percentage."
    },
    {
        "title": "DSC 232 Group Project for Spotify Data",
        "image": "https://alhayslip.github.io/portfolio/images/cluster.png",
        "description": "For my DSC 232 Big Data course, I analyzed spotify data. In this instance, I created a KMeans cluster to group a songs popularity (0 to 100) against its dancability (0 to 1)"
    },
    {
        "title": "Video Games Sales Simple Linear Regression of NA and Global Sales",
        "image": "https://alhayslip.github.io/portfolio/images/linear.png",
        "description": "I worked on a side project by analzying the following dataset https://www.kaggle.com/datasets/gregorut/videogamesales. I performed a linear regression model and learned that the correlation between the North American Sales for a video game as well the global sales for a video games is 85.0%"
    },
    {
        "title": "Lamar Jackson Passing Completions and Passing Yards Cluster (2018 to 2022)",
        "image": "https://alhayslip.github.io/portfolio/images/lamarjacksoncluster.png",
        "description": "I worked on a side project by analzying the passing statistics of football quarterback Lamar Jackson. I performed a KMeans cluster analysis and categorized the performance of Lamar Jackson in terms of completions and passing yards into three distinct clusters"
    },
    {
        "title": "Distribution of Shopping Sales By Season",
        "image": "https://alhayslip.github.io/portfolio/images/salespiechart.png",
        "description": "This pie chart depicts the sales of fashion items as depicted in this dataset: https://www.kaggle.com/datasets/iamsouravbanerjee/customer-shopping-trends-dataset. I create this pie chart to display the visualization of total sales by season."
    },
    {
        "title": "Countplot of Position Players Who Played for the Colorado Rockies By Position",
        "image": "https://alhayslip.github.io/portfolio/images/rockies_batting.png",
        "description": "This barplot was generated from a dataset about position players who played for the Colorado Rockies MLB franchise. This shows that the majority of position players who have played for the rockies are catchers."
    },
    {
        "title": "Scatterplot of EarnedRuns Allowed Allowed and Earned Run Average for Pitchers who played for the Colorado Rockies",
        "image": "https://alhayslip.github.io/portfolio/images/scatterplot.png",
        "description": "This scatterplot visualizes the performance of Colorado Rockies pitchers by the number of earned runs allowed on the x axis and the earned run average on the y axis."
    }
]