[
    {
        "title": "DSC 209 Project 1 Final Submission",
        "image": "https://alhayslip.github.io/portfolio/images/project_1_final.png",
        "description": "This visualization was created from the grocery db csv file that can be found here: https://dsc-courses.github.io/dsc209r-2025-fa/projects/project1/#data-grocery-store-foods. This histogram was used to visualize organic products at Whole Foods by their food processing score"
    },
    {
        "title": "DSC 209 Project 2 Proposition",
        "image": "https://alhayslip.github.io/portfolio/images/lineplot.png",
        "description": "This visualization was created from the Civilian Complaints Against New York City Police Officers dataset, which can be found here https://dsc-courses.github.io/dsc209r-2025-fa/projects/project2/#datasets. This line graph showcases that neighborhood policing in New York resulting in an increase in complaints filed"
    },
    {
        "title": "DSC 209 Project 2 2015 Neighborhood Policing Bar Plot",
        "image": "https://alhayslip.github.io/portfolio/images/2015_barplot.png",
        "description": "This visualization was created from the Civilian Complaints Against New York City Police Officers dataset, which can be found here https://dsc-courses.github.io/dsc209r-2025-fa/projects/project2/#datasets. This barplot indicates that the implementation in neighborhood policing in 2015 increased the number of complaints filed."
    },
    {
        "title": "DSC 209 Project 2 Precinct 75 Pie Chart Before and After Neighborhood Policing",
        "image": "https://alhayslip.github.io/portfolio/images/pie_chart.png",
        "description": "This visualization was created from the Civilian Complaints Against New York City Police Officers dataset, which can be found here https://dsc-courses.github.io/dsc209r-2025-fa/projects/project2/#datasets. I created a pie chart to indicate the distribution of complaints filed from January 2011 to December in Precinct 75 by whether it occurred before or after neighborhood policing was implemented in New York City."
    },
    {
        "title": "DSC 207 Mini Project Boxplot of Happiness by Country",
        "image": "https://alhayslip.github.io/portfolio/images/boxplots.png",
        "description": "For my DSC 207 Python course, I was tasked with analyzing happiness scores by country, which can be found here https://www.kaggle.com/datasets/bhanupratapbiswas/world-happiness-2016. This boxplot visualizes the distribution of life expectancy for region that is referenced in the dataset."
    },
    {
        "title": "DSC 207 Final Project KMeans of NBA field goals data",
        "image": "https://alhayslip.github.io/portfolio/images/kmeans.png",
        "description": "For my DSC 207 Python course, I decided to analyze data for NBA Field Goals attempted between the 2004 and 2022 seasons. This visualization represents a KMeans Clustering Analysis that I performed to categorize groups of players by the amount of field goals attempted and field goal percentage."
    },
    {
        "title": "DSC 232 Group Project for Spotify Data",
        "image": "https://alhayslip.github.io/portfolio/images/cluster.png",
        "description": "For my DSC 232 Big Data course, I analyzed spotify data. In this instance, I created a KMeans cluster to group a songs popularity (0 to 100) against its dancability (0 to 1)"
    },
    {
        "title": "Video Games Sales Simple Linear Regression of NA and Global Sales",
        "image": "https://alhayslip.github.io/portfolio/images/linear.png",
        "description": "I worked on a side project by analzying the following dataset https://www.kaggle.com/datasets/gregorut/videogamesales. I performed a linear regression model and learned that the correlation between the North American Sales for a video game as well the global sales for a video games is 85.0%"
    },
    {
        "title": "Ipsam autem veritatis perspiciatis.",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Harum ut nemo explicabo. Aperiam quam porro facilis facere, doloremque qui totam obcaecati omnis animi. Nesciunt pariatur, excepturi, eaque quo nam ratione incidunt officia maiores consequatur, cum ex repudiandae iure."
    },
    {
        "title": "Ipsam autem veritatis perspiciatis.",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Accusamus quo dolorum ut rem, incidunt ducimus molestiae consectetur perspiciatis accusantium aspernatur nemo quod dignissimos, voluptates minus iusto nobis iste soluta. Libero illum et nemo distinctio blanditiis id dicta totam."
    },
    {
        "title": "Deleniti eum recusandae ex.",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Aliquid reprehenderit, assumenda temporibus alias ex, laborum fuga recusandae suscipit aspernatur sequi rerum. Ratione possimus unde veritatis assumenda, reprehenderit rem excepturi error deserunt eos ab totam illo eligendi beatae saepe?"
    },
    {
        "title": "Incidunt quas sit dolores!",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Exercitationem, veniam libero voluptates nihil quidem ullam dicta cum magnam aliquam odio tempora beatae consequatur minus. Molestias ab amet esse veniam rem. Necessitatibus veniam perspiciatis quo alias nesciunt consequatur porro?"
    }
]